In [28]:
import pandas as pd
import numpy as np
df=pd.read_excel(r"W:\JupyterWS\Files\file_example_10.xls")
df

  First Name  Last Name  Gender        Country  Age        Date    Id
0      Dulce      Abril  Female  United States   32  15/10/2017  1562
1       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     Philip       Gent    Male         France   36  21/05/2015  2587
3   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [2]:
df.groupby('Country').groups

{'France': Int64Index([2], dtype='int64'),
 'Great Britain': Int64Index([1, 6], dtype='int64'),
 'United States': Int64Index([0, 3, 4, 5, 7, 8], dtype='int64')}

In [3]:
grouped_df=df.groupby('Country')
for name,group in grouped_df:
    print(name)
    print(group)
    print('----------------------------------------------')

France
  First Name Last Name Gender Country  Age        Date    Id
2     Philip      Gent   Male  France   36  21/05/2015  2587
----------------------------------------------
Great Britain
  First Name  Last Name  Gender        Country  Age        Date    Id
1       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
6       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
----------------------------------------------
United States
  First Name Last Name  Gender        Country  Age        Date    Id
0      Dulce     Abril  Female  United States   32  15/10/2017  1562
3   Kathleen    Hanner  Female  United States   25  15/10/2017  3549
4    Nereida   Magwood  Female  United States   58  16/08/2016  2468
5     Gaston     Brumm    Male  United States   24  21/05/2015  2554
7    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8   Vincenza   Weiland  Female  United States   40  21/05/2015  6548
----------------------------------------------

In [22]:
grouped_df=df.groupby('Country',sort=True)
grouped_df.first()

              First Name  Last Name  Gender  Age        Date    Id
Country
France            Philip       Gent    Male   36  21/05/2015  2587
Great Britain       Mara  Hashimoto  Female   25  16/08/2016  1582
United States      Dulce      Abril  Female   32  15/10/2017  1562

In [23]:
grouped_df=df.groupby(['Country','Age'],sort=True)
grouped_df.first()

                  First Name  Last Name  Gender        Date    Id
Country       Age
France        36      Philip       Gent    Male  21/05/2015  2587
Great Britain 25        Mara  Hashimoto  Female  16/08/2016  1582
              56        Etta       Hurn  Female  15/10/2017  3598
United States 24      Gaston      Brumm    Male  21/05/2015  2554
              25    Kathleen     Hanner  Female  15/10/2017  3549
              27     Earlean     Melgar  Female  16/08/2016  2456
              32       Dulce      Abril  Female  15/10/2017  1562
              40    Vincenza    Weiland  Female  21/05/2015  6548
              58     Nereida    Magwood  Female  16/08/2016  2468

In [25]:
grouped_df=df.groupby('Country')
grouped_df.get_group('United States')

  First Name Last Name  Gender        Country  Age        Date    Id
0      Dulce     Abril  Female  United States   32  15/10/2017  1562
3   Kathleen    Hanner  Female  United States   25  15/10/2017  3549
4    Nereida   Magwood  Female  United States   58  16/08/2016  2468
5     Gaston     Brumm    Male  United States   24  21/05/2015  2554
7    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

In [26]:
grouped_df['Age'].agg([np.mean,np.median])

                    mean  median
Country
France         36.000000    36.0
Great Britain  40.500000    40.5
United States  34.333333    29.5

In [11]:
grouped_df['Age'].agg(np.max)

Country
France           36
Great Britain    56
United States    58
Name: Age, dtype: int64

In [12]:
grouped_df['Age'].agg(np.min)

Country
France           36
Great Britain    25
United States    24
Name: Age, dtype: int64

In [13]:
grouped_df['Age'].agg(np.median)

Country
France           36.0
Great Britain    40.5
United States    29.5
Name: Age, dtype: float64

In [14]:
grouped_df['Age'].agg(np.size)

Country
France           1
Great Britain    2
United States    6
Name: Age, dtype: int64